const nodeClass = {
		"טרור": "gen",
		"בירוקרטיה": "gen ",
		"אנרכיה": "gen",
		"מודרניזם": "gen",
		"ארכיטקטורה": "gen",
		"פוסט-מודרניזם": "gen",
		"מלחמה": "gen",
		"גלובליזציה": "gen",
		"לוקאליזציה": "gen",
		"ארכיטקטורה": "gen",

		"מושג": "term",
		"אדם": "term",
		"פונטיקה": "term",
		"סינטקס": "term",
		"סמנטיקה": "term",
		"שפה": "term",
		"חומסקי": "term",
		"טקסונומיה": "term",
		"סטרוקטורה": "term",

		"מתמטיקה": "math ",
		"חוה": "math",
		"גרדיאנט": "math",
		"אורתוגרדיאנט": "math",
		"שדה סקלרי": "math",
		"אלגברה": "math",
		"חוג": "math",
		"אידאל": "math ",

		"מרחב": "spc",
		"קין": "spc",
		"הר": "spc",
		"נחל": "spc",
		"טופוגרפיה": "spc",

		"מוזיקה": "mus",
		"מקצב": "mus",
		"יובל": "mus",

		"מיתוס": "myt",
		"אנוש": "myt"

	};

const nodeMessages = {
	"ארכיטקטורה": "הגבול התחתון של הסימולקרה (לכיוון הסימולציה). הארכיטקטורה היא תכנון, לכן היא רעיונית, אולם היא שואפת להתקרב למציאות ככל האפשר<br />הארכיטקטורה מקבלת מושגם מופשטים ומקרבת אותם ככל האפשר למערכות קונקרטיות<br/>המושג הופך לפרוגרמה, המוזיקה לסדר, המרחב לחל, המתמטיקה (והאלגבה בעיקר) למחבר, והמיתוס לקונספט",
	"טרור": "פעולה של גוף על סביבה",
	"בירוקרטיה": "שלטון פקידים. פעולה של סביבה על גוף שמטרתה לפרמט את הזהויות",
	"אנרכיה": "פעולה של סביבה על עצמה. בתוך מערכת בירוקרטית האנרכיה דומה לטרור, בכך שהיא מערערת על הסדרים הקיימים, אולם הוא שואפת להסדיר את הסדרים שלה עצמה בדומה לבירוקרטיה",
	"מודרניזם": "תנועה אידיאליסטית מאחדת. התקופה בה לראשונה נצרכה השאלה ׳מהי ארכיטקטורה׳",
	"פוסט-מודרניזם": "תנועה אידיאליסטית מפרקת. הפוסט מודרניזם מפרק את המושגים של המודרניזם ומייצר במקומם מערכת מיתוסים",
	"מלחמה": ".",
	"גלובליזציה": "כיווץ של מרחבים גדולים. הגלובליזציה מתארת קרבה, או לעיתים זהות, בין ישויות מרוחקות.מתנהגת כמו בירוקרטיה ביחס למרחב",
	"לוקאליזציה": "פירוד של מרחבים, כתגובה לגלובליזציה. מתנהגת כמו טרור ביחס למרחב",

	"מושג": "המושג הוא יחסו של אדם לעולם. הוא מה שאדם נותן לעולם. לפני אדם, לא היה מושג ולא היה צורך בו. הוא תנאי הכרחי לגילוי המתמטיקה. המושג הוא הפך המיתוס",
	"אדם": "אדם הראשון הוא האבטיפוס הראשון של היצור האנושי, שהבא אחריו יהיה אנוש. הוא הראשון להשתמש בשפה כמערכת טקסונומיה ובכך להגדיר ולייצר אבחנות מהותיות בבריאה, במעשה זה נעשה שותף למעשה בראשית או להפך, מתנכל לו ומשנה אותו",
	"פונטיקה": "חומר השפה. חומסקי",
	"סינטקס": "צורת השפה. חומסקי",
	"סמנטיקה": "פנים השפה. חומסקי",
	"שפה": "מערכת דיסקריפטיבית דינמית ",
	"חומסקי": "הוגה דעות בתחום הבלשנות. חומסקי מציע טקסונומיה על חלקי השפה שמורכבת מפונטיקה, סינטקס וסמנטיקה",
	"טקסונומיה": "מיון למינים וזנים שאינו דן בשאלת מהות החלוקה, אלא בשאלת איכות החלוקה (איך לחלק)",
	"סטרוקטורה": "מבנה עצמי של דבר. קריאת דבר כאומנון, על ידי זיהוי סדרים מהותיים  אדם בו",

	"מתמטיקה": "מתמטיקה היא החכמה שלא שואלת למה. היא תוצאה של נתק תקשורתי בין אדם לעולם הטבעי. גילתה אותה חוה, ואחר כך הנחילה אותה לאדם בכלל. היא מטרימה את הארכיטקטורה והופכית למוזיקה",
	"חוה": "חוה אכלה מעץ הדעת לפני שאכלה מעץ החיים, ובכך הנחילה מוות לעולם. היא גם הראשונה להביא חיים לעולם",
	"גרדיאנט": "כיוון ניצב לקו הטופוגרפיה על גבי מישור כלשהו; הוא השיפוע התלול ביותר ביחס לנקודה. הוא הפלט של פונקציית שדה סקלרי. במרחב אמיתי הוא הדרך היעילה ביותר לעבור בין קוי טופוגרפיה שונים, ובכך הוא מבטא היררכיה מוחלטת.",
	"אורתוגרדיאנט": "הניצב לגרדיאנט, כלומר גובה אחיד על גבי מישור כלשהו. הוא מבטא מדרגה בהיררכיה, שכל הגורמים בתוכה כפופים למדרגות שמעליה ובעלי סמכות על המדרגות התחתונות לה<br />האורתוגרדיאנט במטמטיקה הוא המקבילה לקווי טופוגרפיה במרחב..",
	"שדה סקלרי": "פונקצייה על מישור מוגדר המקבלת שתי קואורדינטות (x, y) ומוציאה את הקואורדינטה השלישית – גובה הנקודה (z)",
	"אלגברה": "מערכת במתמטיקה לתיאור פעולות בין מספרים. אלגברה מהווה הפשטה של חיבור, כפל, וכו' כדי לאפשר לדבר עליהם במונחים כללים יותר",
	"חוג": "מבנה אלגברי (אלגברה) שמאפשר להכפיל ולחבר איברים בחוג, כך שתוצאות הפעולות האלגבריות נשארות בתוך החוג",
	"אידאל": "במתמטיקה אידאל מהווה תת חוג. קבוצה של איברים בתוך החוג שמתנהגים כמו חוג בפני עצמם ובנוסף מושכים לתוכם את כל שאר החוג. מכפלה של איבר באידאל עם איבר בחוג תהיה באידאל",

	"מרחב": "מה שמפריד בין הבריות. המרחב הוא חומר הגלם של ארכיטקטורה (חומר הוא חומר הגלם של בניין). ניכוסו הראשון היה על ידי קין. העיר שבנה היא משכן התרבות, ועל כן היא ערש האמנויות. העיר היא פני האדם, והכוחות המשפיעים עליה הם המושג מחד והמיתוס מאידך",
	"קין": "קין הוא בן האדם הראשון. נע ונד עד שבנה את העיר",
	"הר": "מרחב בעל טופוגרפיה רדיקלית שעליו יכולים לזרום נחלים. במובן אחר, הוא מרחב פעולה ליניארי בין טרור מוחלט לבירוקרטיה מוחלטת",
	"נחל": "זרם מים שמחוקק באדמה את הגרדיאנט למישור הממשי",
	"טופוגרפיה": "קו טופוגפרפי הוא אוסף הנקודות בעלות גובה זהה על גבי מישור כלשהו",


	"מוזיקה": "אומנותו של יובל, היא האמנות הראשונה. בהיותה פעולה של הדמיון ועל הדמיון, היא משלימה את המתמטיקה ומאידך מטרימה את המיתוס. מוזיקה מכילה מקצב - שמהווה מערכת שמקשרת בין כל הפרטים, ואקורדים - שהם מערכת יחסים בין פרט לפרט",
	"מקצב": "מערכת יחסים בין חלל לפרט, במוזיקה הוא וא לידי ביטוי בזמן ובאדריכלות ברגיסטרים",
	"יובל": "בנו של למך, והמנגן הראשון. יחד עם שני אחיו, יבל ותובל, נקשר עם הופעת התעשייה וערש התרבות",

	"מיתוס": "שכפול, או הפקעת משמעות, של המושג. המיתוס מרפרר למקור של המושג ומלביש עליו משמעות סימבולית",
	"אנוש": "אנוש הוא האבטיפוס השני של מין האדם, אחרי אדם הראשון. הוא הראשון לתת לעצמים טבעיים משמעות של אלהות, ובכך הוא מחולל המיתוס"
};
export { nodeClass };
export { nodeMessages };
