const nodeClass = {
		"ארכיטקטורה": "gen",
		"טרור": "gen",
                "בירוקרטיה": "gen",
                "אנרכיה": "gen ",
                "מודרניזם": "gen",
                "פוסט-מודרניזם": "gen",
                "מלחמה": "gen",
                "גלובליזציה": "gen",
                "גלוקליזציה": "gen",
                "לוקאליות": "gen",

	        "מושג": "term",
                "אדם": "term",
                "שפה": "term",
                "טקסונומיה": "term",
                "פנומנה": "term",
                "נואומנה": "term",
                "סטרוקטורה": "term",


		"מתמטיקה": "math",
		"פונקציה": "math",
		"חוה": "math",
		"גרדיאנט": "math",
		"אורתוגרדיאנט": "math",
		"שדה סקלרי": "math",
		"אלגברה": "math",
		"חוג": "math",
		"אידאל": "math ",

		"מרחב": "spc",
		"קין": "spc",
		"הר": "spc",
		"נחל": "spc",
		"טופוגרפיה": "spc",

		"מוזיקה": "mus",
		"מקצב": "mus",
		"יובל": "mus",

		"מיתוס": "myt",
		"אנוש": "myt"

	};

const nodeMessages = {
		"ארכיטקטורה": "הגבול התחתון של הסימולקרה (לכיוון הסימולציה). הארכיטקטורה היא תכנון, לכן היא רעיונית, אולם היא שואפת להתקרב למציאות ככל האפשר<br />הארכיטקטורה מקבלת מושגים מופשטים ומקרבת אותם ככל האפשר למערכות קונקרטיות<br/>המושג הופך לפרוגרמה, המוזיקה לסדר, המרחב לחלל, המתמטיקה (והאלגברה בעיקר) למחבר, והמיתוס לקונספט",
                "טרור": "פעולה אלימה של גוף על סביבה. הוא מקור כח מנוגד ומשלים לבירוקרטיה, מפני שהוא נובע מעיגון זהותו של אינדיבידואל בהתנגד להשפעת הסביבה עליו. במדיה, הוא מתייחס לאספירציות של בני אדם או גופים, אולם יש לו נוכחות גם בארכיטקטורה ובמרחב הממשי. למשל, החומה האטלנטית בזמננו, מאחר שאיננה פועלת עוד בשירות של סביבה, אלא מהווה סוכן עצמאי, היא ישות טרוריסטית. במיתוס, אלת המריבות אריס הניחה תפוח זהב עם הכיתוב ״ליפה מכולן״ על שולחן החתונה שאליה לא הוזמנה, שעליו רבו שלוש אלות, מה שהוביל למלחמת טרויה ",
                "בירוקרטיה": "שלטון פקידים. פעולה של סביבה על גוף שמטרתה לפרמט את הזהויות. מקור כח מנוגד ומשלים לטרור, שפועל לייעל מערכת על ידי קודיפיקציה של הרכיבים בה. מלבד ביטויה כמדינה מינהלנית, בירוקרטיה מתגלמת גם בארכיטקטורה. לדוגמה, רשת הבונקרים שנבנו בשירות המפלגה הנאצית לאורך האוקיינוס האטלנטי היוותה פעולה של הבירוקרטיה. במוזיקה, תורת הקונטרפונקט משבצת חומר מוזיקלי בתבנית מאחידה ומוסדרת על פי כללים",
                "אנרכיה": "פעולה של סביבה על עצמה. בתוך מערכת בירוקרטית האנרכיה דומה לטרור, בכך שהיא מערערת על הסדרים הקיימים, אולם היא שואפת לייצר סדרים לעצמה בדומה לבירוקרטיה. במתמטיקה, אנרכיה דומה לאידיאל בהיותה תת-חוג נפרד מכל החוג, אשר בשעה שהוא פועל על איבר מהחוג, הוא מוציאו מהסביבה שלו ושואב אותו לאידיאל. במיתוס, אנטיגונה רוצה לקבור את אחיה פוליניקס בניגוד לחוקי המלך אבל מתוך נאמנות לחוקי האל ",
                "מודרניזם": "תנועה אידיאליסטית מאחדת. התקופה בה לראשונה נצרכה השאלה ׳מהי ארכיטקטורה׳. בנויה על תשתית של מושגים ואבחנות, ושואפת לייצר מתוכן טקסונומיה על המציאות",
                "פוסט-מודרניזם": "תנועה אידיאליסטית מפרקת. הפוסט מודרניזם מפרק את המושגים של המודרניזם ומייצר במקומם מערכת מיתוסים ונרטיבים שאינם מחויבים להלימה ביניהם. היא מהווה תגובה טרוריסטית למודרניזם שקדם לה, והיא פניה התרבותיים של החברה האינדיבידואליסטית",
                "מלחמה": "בין לחם לחלום",
                "גלובליזציה": "כיווץ של מרחבים גדולים. הגלובליזציה מתארת קרבה, או לעיתים זהות, בין ישויות מרוחקות. מייצרת בירוקרטיה אנטי-היררכית בזמן-מרחב",
                "גלוקליזציה": "פירוד של מרחבים, כתגובה לגלובליזציה. יצירה של אבחנות לוקאליות פנימיות – המשתנות בין מקום למקום",
                "לוקאליות": "המרחב המסוים כשלעצמו",

                "מושג": "המושג הוא יחסו של אדם לעולם. הוא מה שאדם נותן לעולם. לפני אדם, לא היה מושג ולא היה צורך בו. אחרי אדם, הוא האופן היחידי להתייחס ישירות לנואומנה. הוא תנאי הכרחי לגילוי המתמטיקה. המושג הוא הפך המיתוס",
                "אדם": "אדם הראשון הוא האבטיפוס הראשון של היצור האנושי, שהבא אחריו יהיה אנוש. הוא הראשון להשתמש בשפה כמערכת טקסונומיה ובכך להגדיר ולייצר אבחנות מהותיות בבריאה. בפעולה זו הוא משנה את מעשה בראשית",
                "שפה": "מערכת דיסקריפטיבית דינמית. מייצרת סמלים מנותקים מהנואומנה",
                "טקסונומיה": "מיון למינים וזנים שאינו דן בשאלת מהות החלוקה, אלא בשאלת איכות החלוקה (איך לחלק). ניתוח בתחום הפנומנה",
                "פנומנה": "הדבר כפי שמופיע לתודעה האנושית, בניגוד לנואומנה",
                "נואומנה": "הדבר כשלעצמו, בניגוד לפנומנה",
                "סטרוקטורה": "מבנה עצמי של דבר. קריאת דבר (ככל שניתן) כנואומנה, על ידי זיהוי סדרים מהותיים בו. ניתוח בתחום הנואומנה",

                "מתמטיקה": "מתמטיקה היא החכמה שלא שואלת למה. היא תוצאה של נתק תקשורתי בין אדם לעולם הטבעי. גילתה אותה חוה, ואחר כך הנחילה אותה לאדם בכלל. המתמטיקה היא תוצאה של מערכות יחסים בין משוגים, שלפניה היו בלתי תלויים. היא מטרימה את הארכיטקטורה והופכית למוזיקה",
                "פונקציה": "פעולה שלוקחת אובייקט ומחזירה אובייקט אחר. באופן טיפוסי לפונקציה יש תחום, ממנו היא מקבלת את האובייקטים, וטווח, אליו היא שולחת את האובייקטים. היא תמיד תשלח את אותו אובייקט בתחום לאותו אובייקט בטווח. ",
				"חוה": "חוה אכלה מעץ הדעת לפני שאכלה מעץ החיים, ובכך הנחילה מוות לעולם. היא גם הראשונה להביא חיים לעולם",
                "גרדיאנט": "כיוון ניצב לקו הטופוגרפיה על גבי מישור כלשהו; הוא השיפוע התלול ביותר ביחס לנקודה. הוא הפלט של פונקציית שדה סקלרי. במרחב אמיתי הוא הדרך היעילה ביותר לעבור בין קוי טופוגרפיה שונים, ובכך הוא מבטא היררכיה מוחלטת.",
                "אורתוגרדיאנט": "הניצב לגרדיאנט, כלומר גובה אחיד על גבי מישור כלשהו. הוא מבטא מדרגה בהיררכיה, שכל הגורמים בתוכה כפופים למדרגות שמעליה ובעלי סמכות על המדרגות התחתונות לה<br />האורתוגרדיאנט במטמטיקה הוא המקבילה לקווי טופוגרפיה במרחב..",
                "שדה סקלרי": "פונקצייה על מישור מוגדר המקבלת שתי קואורדינטות (x, y) ומוציאה את הקואורדינטה השלישית – גובה הנקודה (z)",
                "אלגברה": "מערכת במתמטיקה לתיאור פעולות בין מספרים. אלגברה מהווה הפשטה של חיבור, כפל, וכו' כדי לאפשר לדבר עליהם במונחים כללים יותר",
                "חוג": "מבנה אלגברי (אלגברה) שמאפשר להכפיל ולחבר איברים בחוג, כך שתוצאות הפעולות האלגבריות נשארות בתוך החוג",
                "אידאל": "במתמטיקה אידאל מהווה תת חוג. קבוצה של איברים בתוך החוג שמתנהגים כמו חוג בפני עצמם ובנוסף מושכים לתוכם את כל שאר החוג. מכפלה של איבר באידאל עם איבר בחוג תהיה באידאל",

                "מרחב": "מה שמפריד בין הבריות. המרחב הוא חומר הגלם של ארכיטקטורה (חומר הוא חומר הגלם של בניין). ניכוסו הראשון היה על ידי קין. העיר שבנה היא משכן התרבות, ועל כן היא ערש האמנויות. העיר היא פני האדם, והכוחות המשפיעים עליה הם המושג מחד והמיתוס מאידך",
                "קין": "קין הוא בן האדם הראשון. נע ונד עד שבנה את העיר",
                "הר": "מרחב בעל טופוגרפיה רדיקלית שעליו יכולים לזרום נחלים. במובן אחר, הוא מרחב פעולה ליניארי בין טרור מוחלט לבירוקרטיה מוחלטת",
                "נחל": "זרם מים שמחוקק באדמה את הגרדיאנט למישור הממשי",
                "טופוגרפיה": "קו טופוגפרפי הוא אוסף הנקודות בעלות גובה זהה על גבי מישור כלשהו",


                "מוזיקה": "אומנותו של יובל, היא האמנות הראשונה. בהיותה פעולה של הדמיון ועל הדמיון, היא משלימה את המתמטיקה ומאידך מטרימה את המיתוס. מוזיקה מכילה מקצב - שמהווה מערכת שמקשרת בין כל הפרטים, ואקורדים - שהם מערכת יחסים בין פרט לפרט",
                "מקצב": "מערכת יחסים בין חלל לפרט, במוזיקה הוא וא לידי ביטוי בזמן ובאדריכלות ברגיסטרים",
                "יובל": "בנו של למך, והמנגן הראשון. יחד עם שני אחיו, יבל ותובל, נקשר עם הופעת התעשייה וערש התרבות",

                "מיתוס": "שכפול, או הפקעת משמעות, של המושג. המיתוס מרפרר למקור של המושג ומלביש עליו משמעות סימבולית. הוא פנומנה, או מסמן, של הדבר כשלעצמו",
                "אנוש": "אנוש הוא האבטיפוס השני של מין האדם, אחרי אדם הראשון. הוא הראשון לתת לעצמים טבעיים משמעות של אלהות, ובכך הוא מחולל המיתוס"
            };

const nodeScheme = {
		"ארכיטקטורה": [],
		"טרור": [],
                "בירוקרטיה": [],
                "אנרכיה": [],
                "מודרניזם": [],
                "פוסט-מודרניזם": [],
                "מלחמה": [],
                "גלובליזציה": [],
                "גלוקליזציה": [],
                "לוקאליות": [],

	        "מושג": [["imgs/מושג.png","מושג כמסגור אנושי לעולם"],["imgs/מושג2.png","מושג כהתוויה של אלמנטים"]],
                "אדם": [],
                "שפה": [],
                "טקסונומיה": [],
                "פנומנה": [],
                "נואומנה": [],
                "סטרוקטורה": [],


		"מתמטיקה": [["imgs/מתמטיקה.jpg","מערכות יחסים בין מושגים"]],
		"פונקציה": [["imgs/פונקציה.jpg","דוג' לפונקציה. מקבלת שיפוע ומחזירה חומר"]],
		
		"חוה": [],
		"גרדיאנט": [],
		"אורתוגרדיאנט": [],
		"שדה סקלרי": [],
		"אלגברה": [],
		"חוג": [],
		"אידאל": [],

		"מרחב": [["imgs/מרחב.jpg", "מרחב הוא מה שמפריד בין הבריות"],["imgs/מרחב2.jpg","המרחב מחבר בין כל הבריות"]],
		"קין": [],
		"הר": [],
		"נחל": [],
		"טופוגרפיה": [],

		"מוזיקה": [["imgs/IMG_0420.jpg","צלילים עיליים"]],
		"מקצב": [],
		"יובל": [],

		"מיתוס": [["imgs/מיתוס.jpg","שכפול מושגי של המקור"],["imgs/IMG_0421.jpg","הלב והמעיין"]],
		"אנוש": []

	};
